# St7SetPlateCavityFluid

Assigns a cavity fluid layout to a surface of the specified plate.

Plate Attributes – Set

long St7SetPlateCavityFluid(long uID, long PlateNum, long Surface, long CavityID)

Input Parameters

uID

Strand7 model file ID.

PlateNum

Plate number.

Surface

Local plate surface; either psPlateMinusZ or psPlatePlusZ.

CavityID

Cavity fluid layout ID.

Strand7 API Manual

Plate Attributes – Get